import json
test = [('图形装饰', 121), ('其他', 2988), ('救援装置', 11236), ('办公机械', 11354), ('乐器', 12155), ('食品', 12283), ('武器\\杀虫', 24257), ('刷具', 25991), ('烟草', 29265), ('动物用品', 31911), ('机器和器具', 41392), ('广告设备', 49920), ('摄影设备', 62501), ('实验设备', 104100), ('药品器具', 112192), ('旅行', 165858), ('测量仪器', 189581), ('办公设备', 206210), ('电力设备', 213741), ('建筑元素', 223913), ('工具', 225019), ('机器', 229024), ('玩具体育', 248220), ('装饰品', 251729), ('运输工具', 277068), ('流体设备', 325086), ('家居', 372512), ('照明器具', 424445), ('纺织板材', 428308), ('处理设备', 449634), ('服饰', 546018), ('包装容器', 767204), ('家具', 813208)]

a =  json.dumps(test)


print(a)
print(type(a))

b = json.loads(a)
print(b)
print(type(b))